jagadevan/contiki/cpu/cc2538/dev/gptimer.c
/******************************************************************************
*  Filename:       gptimer.c
*  Revised:        $Date: 2013-04-12 14:54:28 +0200 (Fri, 12 Apr 2013) $
*  Revision:       $Revision: 9731 $
*
*  Description:    Driver for the general purpose timer module.
*
*  Copyright (C) 2012 Texas Instruments Incorporated - http://www.ti.com/
*
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

//*****************************************************************************
//
//! \addtogroup timer_api
//! @{
//
//*****************************************************************************

#include "hw_ints.h"
#include "hw_memmap.h"
#include "hw_gptimer.h"
#include "debug.h"
#include "interrupt.h"
#include "gptimer.h"
//addded
#include "hw_sys_ctrl.h"
#include "gpio.h"
#include "ioc.h"
//*****************************************************************************
//
//! \internal
//! Checks a timer base address
//!
//! \param ui32Base is the base address of the timer module.
//!
//! This function determines if a timer module base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef ENABLE_ASSERT
static bool
TimerBaseValid(uint32_t ui32Base)
{
    return((ui32Base == GPTIMER0_BASE) || (ui32Base == GPTIMER1_BASE) ||
           (ui32Base == GPTIMER2_BASE) || (ui32Base == GPTIMER3_BASE));
}
#endif

//*****************************************************************************
//
//! Enables the timer(s)
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to enable; must be one of \b GPTIMER_A,
//! \b GPTIMER_B, or \b GPTIMER_BOTH.
//!
//! This function enables operation of the timer module.  The timer must be
//! configured before it is enabled.
//!
//! \return None
//
//*****************************************************************************
void
TimerEnable(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));

    //
    // Enable the timer(s) module.
    //
    HWREG(ui32Base + GPTIMER_O_CTL) |= ui32Timer & (GPTIMER_CTL_TAEN | GPTIMER_CTL_TBEN);
}

//*****************************************************************************
//
//! Disables the timer(s)
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to disable; must be one of
//! \b GPTIMER_A, \b GPTIMER_B, or \b GPTIMER_BOTH.
//!
//! This function disables operation of the timer module.
//!
//! \return None
//
//*****************************************************************************
void
TimerDisable(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));

    //
    // Disable the timer module.
    //
    HWREG(ui32Base + GPTIMER_O_CTL) &= ~(ui32Timer &
                                         (GPTIMER_CTL_TAEN | GPTIMER_CTL_TBEN));
}


//*****************************************************************************
//
//! Configures the timer(s)
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Config is the configuration for the timer.
//!
//! This function configures the operating mode of the timer(s).  The timer
//! module is disabled before being configured, and is left in the disabled
//! state.
//! The 16/32-bit timer is comprised of two 16-bit timers that can
//! operate independently or be concatenated to form a 32-bit timer.
//!
//! The configuration is specified in \e ui32Config as one of the following
//! values:
//!
//! - \b GPTIMER_CFG_ONE_SHOT - Full-width one-shot timer
//! - \b GPTIMER_CFG_ONE_SHOT_UP - Full-width one-shot timer that counts up
//!   instead of down (not available on all parts)
//! - \b GPTIMER_CFG_PERIODIC - Full-width periodic timer
//! - \b GPTIMER_CFG_PERIODIC_UP - Full-width periodic timer that counts up
//!   instead of down (not available on all parts)
//! - \b GPTIMER_CFG_SPLIT_PAIR - Two half-width timers
//!
//! When configured for a pair of half-width timers, each timer is separately
//! configured.  The first timer is configured by setting \e ui32Config to
//! the result of a logical OR operation between one of the following values
//! and \e ui32Config:
//!
//! - \b GPTIMER_CFG_A_ONE_SHOT - Half-width one-shot timer
//! - \b GPTIMER_CFG_A_ONE_SHOT_UP - Half-width one-shot timer that counts up
//!   instead of down (not available on all parts)
//! - \b GPTIMER_CFG_A_PERIODIC - Half-width periodic timer
//! - \b GPTIMER_CFG_A_PERIODIC_UP - Half-width periodic timer that counts up
//!   instead of down (not available on all parts)
//! - \b GPTIMER_CFG_A_CAP_COUNT - Half-width edge count capture
//! - \b GPTIMER_CFG_A_CAP_COUNT_UP - Half-width edge count capture that counts
//!   up instead of down (not available on all parts)
//! - \b GPTIMER_CFG_A_CAP_TIME - Half-width edge time capture
//! - \b GPTIMER_CFG_A_CAP_TIME_UP - Half-width edge time capture that
//!   counts up instead of down (not available on all parts)
//! - \b GPTIMER_CFG_A_PWM - Half-width PWM output
//!
//! Similarly, the second timer is configured by setting \e ui32Config to
//! the result of a logical OR operation between one of the corresponding
//! \b GPTIMER_CFG_B_* values and \e ui32Config.
//!
//! \return None
//
//*****************************************************************************
void
TimerConfigure(uint32_t ui32Base, uint32_t ui32Config)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Config == GPTIMER_CFG_ONE_SHOT) ||
           (ui32Config == GPTIMER_CFG_ONE_SHOT_UP) ||
           (ui32Config == GPTIMER_CFG_PERIODIC) ||
           (ui32Config == GPTIMER_CFG_PERIODIC_UP) ||
           ((ui32Config & 0xff000000) == GPTIMER_CFG_SPLIT_PAIR));
    ASSERT(((ui32Config & 0xff000000) != GPTIMER_CFG_SPLIT_PAIR) ||
           ((((ui32Config & 0x000000ff) == GPTIMER_CFG_A_ONE_SHOT) ||
             ((ui32Config & 0x000000ff) == GPTIMER_CFG_A_ONE_SHOT_UP) ||
             ((ui32Config & 0x000000ff) == GPTIMER_CFG_A_PERIODIC) ||
             ((ui32Config & 0x000000ff) == GPTIMER_CFG_A_PERIODIC_UP) ||
             ((ui32Config & 0x000000ff) == GPTIMER_CFG_A_CAP_COUNT) ||
             ((ui32Config & 0x000000ff) == GPTIMER_CFG_A_CAP_TIME) ||
             ((ui32Config & 0x000000ff) == GPTIMER_CFG_A_PWM)) &&
            (((ui32Config & 0x0000ff00) == GPTIMER_CFG_B_ONE_SHOT) ||
             ((ui32Config & 0x0000ff00) == GPTIMER_CFG_B_ONE_SHOT_UP) ||
             ((ui32Config & 0x0000ff00) == GPTIMER_CFG_B_PERIODIC) ||
             ((ui32Config & 0x0000ff00) == GPTIMER_CFG_B_PERIODIC_UP) ||
             ((ui32Config & 0x0000ff00) == GPTIMER_CFG_B_CAP_COUNT) ||
             ((ui32Config & 0x0000ff00) == GPTIMER_CFG_B_CAP_COUNT_UP) ||
             ((ui32Config & 0x0000ff00) == GPTIMER_CFG_B_CAP_TIME) ||
             ((ui32Config & 0x0000ff00) == GPTIMER_CFG_B_CAP_TIME_UP) ||
             ((ui32Config & 0x0000ff00) == GPTIMER_CFG_B_PWM))));

    //
    // Disable the timers.
    //
    HWREG(ui32Base + GPTIMER_O_CTL) &= ~(GPTIMER_CTL_TAEN | GPTIMER_CTL_TBEN);

    //
    // Set the global timer configuration.
    //
    HWREG(ui32Base + GPTIMER_O_CFG) = ui32Config >> 24;

    //
    // Set the configuration of the A and B timers.  Note that the B timer
    // configuration is ignored by the hardware in 32-bit modes.
    //
    HWREG(ui32Base + GPTIMER_O_TAMR) = (ui32Config & 255) | GPTIMER_TAMR_TAPWMIE;
    HWREG(ui32Base + GPTIMER_O_TBMR) =
        ((ui32Config >> 8) & 255) | GPTIMER_TBMR_TBPWMIE;
}

//*****************************************************************************
//
//! Controls the output level
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to adjust; must be one of \b GPTIMER_A,
//! \b GPTIMER_B, or \b GPTIMER_BOTH.
//! \param bInvert specifies the output level.
//!
//! This function sets the PWM output level for the specified timer.  If the
//! \e bInvert parameter is \b true, then the timer's output is made active
//! low; otherwise, it is made active high.
//!
//! \return None
//
//*****************************************************************************
void
TimerControlLevel(uint32_t ui32Base, uint32_t ui32Timer,
                  bool bInvert)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));

    //
    // Set the output levels as requested.
    //
    ui32Timer &= GPTIMER_CTL_TAPWML | GPTIMER_CTL_TBPWML;
    HWREG(ui32Base + GPTIMER_O_CTL) = (bInvert ?
                                       (HWREG(ui32Base + GPTIMER_O_CTL) | ui32Timer) :
                                       (HWREG(ui32Base + GPTIMER_O_CTL) & ~(ui32Timer)));
}

//*****************************************************************************
//
//! Enables or disables the trigger output
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer to adjust; must be one of \b GPTIMER_A,
//! \b GPTIMER_B, or \b GPTIMER_BOTH.
//! \param bEnable specifies the desired trigger state.
//!
//! This function controls the trigger output for the specified timer.  If the
//! \e bEnable parameter is \b true, then the timer's output trigger is
//! enabled; otherwise it is disabled.
//!
//! \return None
//
//*****************************************************************************
void
TimerControlTrigger(uint32_t ui32Base, uint32_t ui32Timer,
                    bool bEnable)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));

    //
    // Set the trigger output as requested.
    //
    ui32Timer &= GPTIMER_CTL_TAOTE | GPTIMER_CTL_TBOTE;
    HWREG(ui32Base + GPTIMER_O_CTL) = (bEnable ?
                                       (HWREG(ui32Base + GPTIMER_O_CTL) | ui32Timer) :
                                       (HWREG(ui32Base + GPTIMER_O_CTL) & ~(ui32Timer)));
}

//*****************************************************************************
//
//! Controls the event type
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to be adjusted; must be one of
//! \b GPTIMER_A, \b GPTIMER_B, or \b GPTIMER_BOTH.
//! \param ui32Event specifies the type of event; must be one of
//! \b GPTIMER_EVENT_POS_EDGE, \b GPTIMER_EVENT_NEG_EDGE, or
//! \b GPTIMER_EVENT_BOTH_EDGES.
//!
//! This function sets the signal edge(s) that triggers the timer when in
//! capture mode.
//!
//! \return None
//
//*****************************************************************************
void
TimerControlEvent(uint32_t ui32Base, uint32_t ui32Timer,
                  uint32_t ui32Event)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));

    //
    // Set the event type.
    //
    ui32Timer &= GPTIMER_CTL_TAEVENT_M | GPTIMER_CTL_TBEVENT_M;
    HWREG(ui32Base + GPTIMER_O_CTL) = ((HWREG(ui32Base + GPTIMER_O_CTL) & ~ui32Timer) |
                                       (ui32Event & ui32Timer));
}

//*****************************************************************************
//
//! Controls the stall handling
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to be adjusted; must be one of
//! \b GPTIMER_A, \b GPTIMER_B, or \b GPTIMER_BOTH.
//! \param bStall specifies the response to a stall signal.
//!
//! This function controls the stall response for the specified timer.  If the
//! \e bStall parameter is \b true, then the timer stops counting if the
//! processor enters debug mode; otherwise the timer keeps running while in
//! debug mode.
//!
//! \return None
//
//*****************************************************************************
void
TimerControlStall(uint32_t ui32Base, uint32_t ui32Timer,
                  bool bStall)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));

    //
    // Set the stall mode.
    //
    ui32Timer &= GPTIMER_CTL_TASTALL | GPTIMER_CTL_TBSTALL;
    HWREG(ui32Base + GPTIMER_O_CTL) = (bStall ?
                                       (HWREG(ui32Base + GPTIMER_O_CTL) | ui32Timer) :
                                       (HWREG(ui32Base + GPTIMER_O_CTL) & ~(ui32Timer)));
}

//*****************************************************************************
//
//! Controls the wait on trigger handling
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to be adjusted; must be one of
//! \b GPTIMER_A, \b GPTIMER_B, or \b GPTIMER_BOTH.
//! \param bWait specifies if the timer should wait for a trigger input.
//!
//! This function controls whether or not a timer waits for a trigger input to
//! start counting.  When enabled, the previous timer in the trigger chain must
//! count to its timeout in order for this timer to start counting.  Refer to
//! the part's data sheet for a description of the trigger chain.
//!
//! \note This functionality is not available on all parts.
//!
//! \return None
//
//*****************************************************************************
void
TimerControlWaitOnTrigger(uint32_t ui32Base, uint32_t ui32Timer,
                          bool bWait)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));

    //
    // Set the wait on trigger mode for timer A.
    //
    if((ui32Timer & GPTIMER_A) != 0)
    {
        if(bWait)
        {
            HWREG(ui32Base + GPTIMER_O_TAMR) |= GPTIMER_TAMR_TAWOT;
        }
        else
        {
            HWREG(ui32Base + GPTIMER_O_TAMR) &= ~(GPTIMER_TAMR_TAWOT);
        }
    }

    //
    // Set the wait on trigger mode for timer B.
    //
    if((ui32Timer & GPTIMER_B) != 0)
    {
        if(bWait)
        {
            HWREG(ui32Base + GPTIMER_O_TBMR) |= GPTIMER_TBMR_TBWOT;
        }
        else
        {
            HWREG(ui32Base + GPTIMER_O_TBMR) &= ~(GPTIMER_TBMR_TBWOT);
        }
    }
}

//*****************************************************************************
//
//! Set the timer prescale value
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to adjust; must be one of \b GPTIMER_A,
//! \b GPTIMER_B, or \b GPTIMER_BOTH.
//! \param ui32Value is the timer prescale value; must be between 0 and 255,
//! inclusive.
//!
//! This function sets the value of the input clock prescaler.  The prescaler
//! is only operational when in 16-bit mode and is used to extend the range of
//! the 16-bit timer modes.
//!
//! \note The availability of the prescaler varies with the timer mode in use.
//! Please consult the datasheet for the part you are using
//! to determine whether this support is available.
//!
//! \return None
//
//*****************************************************************************
void
TimerPrescaleSet(uint32_t ui32Base, uint32_t ui32Timer,
                 uint32_t ui32Value)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));
    ASSERT(ui32Value < 256);

    //
    // Set the timer A prescaler if requested.
    //
    if(ui32Timer & GPTIMER_A)
    {
        HWREG(ui32Base + GPTIMER_O_TAPR) = ui32Value;
    }

    //
    // Set the timer B prescaler if requested.
    //
    if(ui32Timer & GPTIMER_B)
    {
        HWREG(ui32Base + GPTIMER_O_TBPR) = ui32Value;
    }
}

//*****************************************************************************
//
//! Get the timer prescale value
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer; must be one of \b GPTIMER_A or
//! \b GPTIMER_B.
//!
//! This function gets the value of the input clock prescaler.  The prescaler
//! is only operational when in 16-bit mode and is used to extend the range of
//! the 16-bit timer modes.
//!
//! \note The availability of the prescaler varies with the timer mode in use.
//! Please consult the datasheet for the part you are using
//! to determine whether this support is available.
//!
//! \return The value of the timer prescaler
//
//*****************************************************************************
uint32_t
TimerPrescaleGet(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));

    //
    // Return the appropriate prescale value.
    //
    return((ui32Timer == GPTIMER_A) ? HWREG(ui32Base + GPTIMER_O_TAPR) :
           HWREG(ui32Base + GPTIMER_O_TBPR));
}

//*****************************************************************************
//
//! Set the timer prescale match value
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to adjust; must be one of
//! \b GPTIMER_A, \b GPTIMER_B, or \b GPTIMER_BOTH.
//! \param ui32Value is the timer prescale match value; must be between 0 and
//! 255, inclusive.
//!
//! This function sets the value of the input clock prescaler match value.
//! When in a 16-bit mode that uses the counter match and the prescaler, the
//! prescale match effectively extends the range of the counter to 24-bits.
//!
//! \note The availability of the prescaler match varies with the timer mode
//! in use.  Please consult the datasheet for the part you are using to
//! determine whether this support is available.
//!
//! \return None
//
//*****************************************************************************
void
TimerPrescaleMatchSet(uint32_t ui32Base, uint32_t ui32Timer,
                      uint32_t ui32Value)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));
    ASSERT(ui32Value < 256);

    //
    // Set the timer A prescale match if requested.
    //
    if(ui32Timer & GPTIMER_A)
    {
        HWREG(ui32Base + GPTIMER_O_TAPMR) = ui32Value;
    }

    //
    // Set the timer B prescale match if requested.
    //
    if(ui32Timer & GPTIMER_B)
    {
        HWREG(ui32Base + GPTIMER_O_TBPMR) = ui32Value;
    }
}

//*****************************************************************************
//
//! Get the timer prescale match value
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer; must be one of \b GPTIMER_A or
//! \b GPTIMER_B.
//!
//! This function gets the value of the input clock prescaler match value.
//! When in a 16-bit mode that uses the counter match and prescaler, the
//! prescale match effectively extends the range of the counter to 24-bits.
//!
//! \note The availability of the prescaler match varies with the timer mode
//! in use.  Please consult the datasheet for the part you are using to
//! determine whether this support is available.
//!
//! \return The value of the timer prescale match.
//
//*****************************************************************************
uint32_t
TimerPrescaleMatchGet(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));

    //
    // Return the appropriate prescale match value.
    //
    return((ui32Timer == GPTIMER_A) ? HWREG(ui32Base + GPTIMER_O_TAPMR) :
           HWREG(ui32Base + GPTIMER_O_TBPMR));
}

//*****************************************************************************
//
//! Sets the timer load value
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to adjust; must be one of:
//! \b GPTIMER_A, \b GPTIMER_B, or \b GPTIMER_BOTH. Only \b GPTIMER_A should
//! be used when the timer is configured for 32-bit operation.
//! \param ui32Value is the load value.
//!
//! This function sets the timer load value; if the timer is running then the
//! value will be immediately loaded into the timer.
//!
//! \return None
//
//*****************************************************************************
void
TimerLoadSet(uint32_t ui32Base, uint32_t ui32Timer,
             uint32_t ui32Value)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));

    //
    // Set the timer A load value if requested.
    //
    if(ui32Timer & GPTIMER_A)
    {
        HWREG(ui32Base + GPTIMER_O_TAILR) = ui32Value;
    }

    //
    // Set the timer B load value if requested.
    //
    if(ui32Timer & GPTIMER_B)
    {
        HWREG(ui32Base + GPTIMER_O_TBILR) = ui32Value;
    }
}

