jagadevan/contiki/cpu/cc2538/dev/gptimer.c
//*****************************************************************************
//
//! Gets the timer load value
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer; must be one of \b GPTIMER_A or
//! \b GPTIMER_B.  Only \b GPTIMER_A should be used when the timer is
//! configured for 32-bit operation.
//!
//! This function gets the currently programmed interval load value for the
//! specified timer.
//!
//! \return Returns the load value for the timer.
//
//*****************************************************************************
uint32_t
TimerLoadGet(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B));

    //
    // Return the appropriate load value.
    //
    return((ui32Timer == GPTIMER_A) ? HWREG(ui32Base + GPTIMER_O_TAILR) :
           HWREG(ui32Base + GPTIMER_O_TBILR));
}



//*****************************************************************************
//
//! Gets the current timer value
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer; must be one of \b GPTIMER_A or
//! \b GPTIMER_B.  Only \b GPTIMER_A should be used when the timer is
//! configured for 32-bit operation.
//!
//! This function reads the current value of the specified timer.
//!
//! \return Returns the current value of the timer.
//
//*****************************************************************************
uint32_t
TimerValueGet(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B));

    //
    // Return the appropriate timer value.
    //
    return((ui32Timer == GPTIMER_A) ? HWREG(ui32Base + GPTIMER_O_TAR) :
           HWREG(ui32Base + GPTIMER_O_TBR));
}

//*****************************************************************************
//
//! Sets the timer match value
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to adjust; must be one of
//! \b GPTIMER_A, \b GPTIMER_B, or \b GPTIMER_BOTH.  Only \b GPTIMER_A should
//! be used when the timer is configured for 32-bit operation.
//! \param ui32Value is the match value.
//!
//! This function sets the match value for a timer.  This is used in capture
//! count mode to determine when to interrupt the processor and in PWM mode to
//! determine the duty cycle of the output signal.
//!
//! \return None
//
//*****************************************************************************
void
TimerMatchSet(uint32_t ui32Base, uint32_t ui32Timer,
              uint32_t ui32Value)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));

    //
    // Set the timer A match value if requested.
    //
    if(ui32Timer & GPTIMER_A)
    {
        HWREG(ui32Base + GPTIMER_O_TAMATCHR) = ui32Value;
    }

    //
    // Set the timer B match value if requested.
    //
    if(ui32Timer & GPTIMER_B)
    {
        HWREG(ui32Base + GPTIMER_O_TBMATCHR) = ui32Value;
    }
}

//*****************************************************************************
//
//! Gets the timer match value
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer; must be one of \b GPTIMER_A or
//! \b GPTIMER_B.  Only \b GPTIMER_A should be used when the timer is
//! configured for 32-bit operation.
//!
//! This function gets the match value for the specified timer.
//!
//! \return Returns the match value for the timer.
//
//*****************************************************************************
uint32_t
TimerMatchGet(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B));

    //
    // Return the appropriate match value.
    //
    return((ui32Timer == GPTIMER_A) ? HWREG(ui32Base + GPTIMER_O_TAMATCHR) :
           HWREG(ui32Base + GPTIMER_O_TBMATCHR));
}

//*****************************************************************************
//
//! Registers an interrupt handler for the timer interrupt
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s); must be one of \b GPTIMER_A,
//! \b GPTIMER_B, or \b GPTIMER_BOTH.
//! \param pfnHandler is a pointer to the function to be called when the timer
//! interrupt occurs.
//!
//! This function sets the handler to be called when a timer interrupt occurs.
//! In addition, this function enables the global interrupt in the interrupt
//! controller; specific timer interrupts must be enabled via TimerIntEnable().
//! It is the interrupt handler's responsibility to clear the interrupt source
//! via TimerIntClear().
//!
//! \sa See IntRegister() for important information about registering interrupt
//! handlers.
//!
//! \return None
//
//*****************************************************************************
void
TimerIntRegister(uint32_t ui32Base, uint32_t ui32Timer,
                 void (*pfnHandler)(void))
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));

    //
    // Get the interrupt number for this timer module.
    //
    ui32Base = ((ui32Base == GPTIMER0_BASE) ? INT_TIMER0A :
                ((ui32Base == GPTIMER1_BASE) ? INT_TIMER1A :
                 ((ui32Base == GPTIMER2_BASE) ? INT_TIMER2A : INT_TIMER3A)));

    //
    // Register an interrupt handler for timer A if requested.
    //
    if(ui32Timer & GPTIMER_A)
    {
        //
        // Register the interrupt handler.
        //
        IntRegister(ui32Base, pfnHandler);

        //
        // Enable the interrupt.
        //
        IntEnable(ui32Base);
    }

    //
    // Register an interrupt handler for timer B if requested.
    //
    if(ui32Timer & GPTIMER_B)
    {
        //
        // Register the interrupt handler.
        //
        IntRegister(ui32Base + 1, pfnHandler);

        //
        // Enable the interrupt.
        //
        IntEnable(ui32Base + 1);
    }
}

//*****************************************************************************
//
//! Unregisters an interrupt handler for the timer interrupt
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s); must be one of \b GPTIMER_A,
//! \b GPTIMER_B, or \b GPTIMER_BOTH.
//!
//! This function clears the handler to be called when a timer interrupt
//! occurs.  This function also masks off the interrupt in the interrupt
//! controller so that the interrupt handler no longer is called.
//!
//! \sa See IntRegister() for important information about registering interrupt
//! handlers.
//!
//! \return None
//
//*****************************************************************************
void
TimerIntUnregister(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == GPTIMER_A) || (ui32Timer == GPTIMER_B) ||
           (ui32Timer == GPTIMER_BOTH));

    //
    // Get the interrupt number for this timer module.
    //
    ui32Base = ((ui32Base == GPTIMER0_BASE) ? INT_TIMER0A :
                ((ui32Base == GPTIMER1_BASE) ? INT_TIMER1A :
                 ((ui32Base == GPTIMER2_BASE) ? INT_TIMER2A : INT_TIMER3A)));

    //
    // Unregister the interrupt handler for timer A if requested.
    //
    if(ui32Timer & GPTIMER_A)
    {
        //
        // Disable the interrupt.
        //
        IntDisable(ui32Base);

        //
        // Unregister the interrupt handler.
        //
        IntUnregister(ui32Base);
    }

    //
    // Unregister the interrupt handler for timer B if requested.
    //
    if(ui32Timer & GPTIMER_B)
    {
        //
        // Disable the interrupt.
        //
        IntDisable(ui32Base + 1);

        //
        // Unregister the interrupt handler.
        //
        IntUnregister(ui32Base + 1);
    }
}

//*****************************************************************************
//
//! Enables individual timer interrupt sources
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32IntFlags is the bit mask of the interrupt sources to be enabled.
//!
//! Enables the indicated timer interrupt sources.  Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor.
//!
//! The \e ui32IntFlags parameter must be the logical OR of any combination of
//! the following:
//!
//! - \b GPTIMER_CAPB_EVENT  - Capture B event interrupt
//! - \b GPTIMER_CAPB_MATCH  - Capture B match interrupt
//! - \b GPTIMER_TIMB_TIMEOUT  - Timer B timeout interrupt
//! - \b GPTIMER_CAPA_EVENT  - Capture A event interrupt
//! - \b GPTIMER_CAPA_MATCH  - Capture A match interrupt
//! - \b GPTIMER_TIMA_TIMEOUT  - Timer A timeout interrupt
//!
//! \return None
//
//*****************************************************************************
void
TimerIntEnable(uint32_t ui32Base, uint32_t ui32IntFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));

    //
    // Enable the specified interrupts.
    //
    HWREG(ui32Base + GPTIMER_O_IMR) |= ui32IntFlags;
}

//*****************************************************************************
//
//! Disables individual timer interrupt sources
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32IntFlags is the bit mask of the interrupt sources to be disabled.
//!
//! Disables the indicated timer interrupt sources.  Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor.
//!
//! The \e ui32IntFlags parameter has the same definition as the \e ui32IntFlags
//! parameter to TimerIntEnable().
//!
//! \return None
//
//*****************************************************************************
void
TimerIntDisable(uint32_t ui32Base, uint32_t ui32IntFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));

    //
    // Disable the specified interrupts.
    //
    HWREG(ui32Base + GPTIMER_O_IMR) &= ~(ui32IntFlags);
}

//*****************************************************************************
//
//! Gets the current interrupt status
//!
//! \param ui32Base is the base address of the timer module.
//! \param bMasked is false if the raw interrupt status is required and true if
//! the masked interrupt status is required.
//!
//! This function returns the interrupt status for the timer module.  Either
//! the raw interrupt status or the status of interrupts that are allowed to
//! reflect to the processor can be returned.
//!
//! \return The current interrupt status, enumerated as a bit field of
//! values described in TimerIntEnable().
//
//*****************************************************************************
uint32_t
TimerIntStatus(uint32_t ui32Base, bool bMasked)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));

    //
    // Return either the interrupt status or the raw interrupt status as
    // requested.
    //
    return(bMasked ? HWREG(ui32Base + GPTIMER_O_MIS) :
           HWREG(ui32Base + GPTIMER_O_RIS));
}

//*****************************************************************************
//
//! Clears timer interrupt sources
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32IntFlags is a bit mask of the interrupt sources to be cleared.
//!
//! The specified timer interrupt sources are cleared, so that they no longer
//! assert.  This function must be called in the interrupt handler to keep the
//! interrupt from being triggered again immediately upon exit.
//!
//! The \e ui32IntFlags parameter has the same definition as the \e ui32IntFlags
//! parameter to TimerIntEnable().
//!
//! \note Because there is a write buffer in the Cortex-M3 processor, it may
//! take several clock cycles before the interrupt source is actually cleared.
//! Therefore, it is recommended that the interrupt source be cleared early in
//! the interrupt handler (as opposed to the very last action) to avoid
//! returning from the interrupt handler before the interrupt source is
//! actually cleared.  Failure to do so may result in the interrupt handler
//! being immediately reentered (because the interrupt controller still sees
//! the interrupt source asserted).
//!
//! \return None
//
//*****************************************************************************
void
TimerIntClear(uint32_t ui32Base, uint32_t ui32IntFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));

    //
    // Clear the requested interrupt sources.
    //
    HWREG(ui32Base + GPTIMER_O_ICR) = ui32IntFlags;
}

//*****************************************************************************
//
//! Synchronizes the counters in a set of timers
//!
//! \param ui32Base is the base address of the timer module.  This must be the
//! base address of Timer0 (in other words, \b GPTIMER0_BASE).
//! \param ui32Timers is the set of timers to synchronize.
//!
//! This function will synchronize the counters in a specified set of timers.
//! When a timer is running in half-width mode, each half can be included or
//! excluded in the synchronization event.  When a timer is running in
//! full-width mode, only the A timer can be synchronized (specifying the B
//! timer has no effect).
//!
//! The \e ui32Timers parameter is the logical OR of any of the following
//! defines:
//!
//! - \b GPTIMER_0A_SYNC
//! - \b GPTIMER_0B_SYNC
//! - \b GPTIMER_1A_SYNC
//! - \b GPTIMER_1B_SYNC
//! - \b GPTIMER_2A_SYNC
//! - \b GPTIMER_2B_SYNC
//! - \b GPTIMER_3A_SYNC
//! - \b GPTIMER_3B_SYNC
//!
//! \note This functionality is not available on all parts.
//!
//! \return None
//
//*****************************************************************************
void
TimerSynchronize(uint32_t ui32Base, uint32_t ui32Timers)
{
    //
    // Check the arguments.
    //
    ASSERT(ui32Base == GPTIMER0_BASE);

    //
    // Synchronize the specified timers.
    //
    HWREG(ui32Base + GPTIMER_O_SYNC) = ui32Timers;
}



void pwm_driver_static_init (uint32_t period , uint32_t match )
{
  /* Enable module clock for the GPTx in Active mode */
  REG(SYS_CTRL_RCGCGPT) |= SYS_CTRL_RCGCGPT_GPT2;
   /* Stop the timer */
   /* Step1 : Ensure the timer is disabled (the TnEN bit is cleared) before making any changes */
   REG(GPT_2_BASE + GPTIMER_CTL) = 0;    // step 1

   /* Use 16-bit timer */
   /* Step2 : Write the GPTM Configuration (GPTIMER_CFG) register with a value of 0x0000.0004.*/
   REG(GPT_2_BASE + GPTIMER_CFG) = 0x04; // step 2


   /* Configure PWM mode */
   REG(GPT_2_BASE + GPTIMER_TAMR) = 0;
   REG(GPT_2_BASE + GPTIMER_TAMR) |= GPTIMER_TAMR_TAAMS;
   REG(GPT_2_BASE + GPTIMER_TAMR) |= GPTIMER_TAMR_TAMR_PERIODIC;

   /* Set the start value (period), count down */
   REG(GPT_2_BASE+ GPTIMER_TAILR) = period ; //999;
   /* Set the deassert period */
   REG(GPT_2_BASE + GPTIMER_TAMATCHR) = match;//50;
   /* Configure pin */
   ioc_set_sel(GPIO_A_NUM, 3, IOC_PXX_SEL_GPT2_ICP1);
   ioc_set_over(GPIO_A_NUM, 3, IOC_OVERRIDE_OE);
   GPIO_PERIPHERAL_CONTROL(GPIO_PORT_TO_BASE(GPIO_A_NUM), GPIO_PIN_MASK(3));
   /* Enable */
   REG(GPTIMER_CTL + GPT_2_BASE ) |= GPTIMER_CTL_TAEN;

