jagadevan/contiki/cpu/cc2538/dev/gptimer.c
}



int pwm_driver_gen_initialize (uint32_t timerBaseAddr, uint32_t timerName, uint32_t period , uint32_t dutyCycle, uint32_t gpioPortNum, uint32_t gpioPinNumber )
{
   /* Note :  Do not change order to optimize code */
   int retval = PWM_DRIVER_INIT_SUCCESS;
   uint32_t timer_enable_reg_bit_mask = 0;
   uint32_t periph_output_signal_to_pad = 0;   
   
   /* Validation for pin number and port number  */ 
   if   (!((gpioPortNum >= GPIO_A_NUM) && (gpioPortNum <= GPIO_D_NUM ) && (gpioPinNumber >= 0) && (gpioPinNumber <= 7)))
   {    
	retval = PWM_DRIVER_INIT_FAILED;
	printf("Validation failed for pin and port number parameter \n");
        return retval;
   }
     
   /* Enable module clock for the GPTx in Active mode */
   if  (timerBaseAddr == GPT_0_BASE )
   {    REG(SYS_CTRL_RCGCGPT) |= SYS_CTRL_RCGCGPT_GPT0;
	periph_output_signal_to_pad = IOC_PXX_SEL_GPT0_ICP1;
   	}
   else if (timerBaseAddr == GPT_1_BASE)
   {    REG(SYS_CTRL_RCGCGPT) |= SYS_CTRL_RCGCGPT_GPT1;
	periph_output_signal_to_pad = IOC_PXX_SEL_GPT1_ICP1;
   	}
   else if (timerBaseAddr == GPT_2_BASE)
   {    REG(SYS_CTRL_RCGCGPT) |= SYS_CTRL_RCGCGPT_GPT2;
	periph_output_signal_to_pad = IOC_PXX_SEL_GPT2_ICP1;
   	}
   else if (timerBaseAddr == GPT_3_BASE)
   {    REG(SYS_CTRL_RCGCGPT) |= SYS_CTRL_RCGCGPT_GPT3;
	periph_output_signal_to_pad = IOC_PXX_SEL_GPT3_ICP1;
   	}   
   else
   {   	retval = PWM_DRIVER_INIT_FAILED; 
	printf( "Wrong Timer base address parameter\n");
        return retval;
  	}

   /* Stop the timer */
   REG(timerBaseAddr + GPTIMER_CTL) = 0;
   
   /* Use 16-bit timer */
   REG(timerBaseAddr + GPTIMER_CFG) = 0x04;

   /* Configure PWM mode for repective TIMERA or TIMERB */
   if ( timerName == GPTIMER_A ) 
   {
   	REG(timerBaseAddr + GPTIMER_TAMR) = 0;
   	REG(timerBaseAddr + GPTIMER_TAMR) |= GPTIMER_TAMR_TAAMS;
   	REG(timerBaseAddr + GPTIMER_TAMR) |= GPTIMER_TAMR_TAMR_PERIODIC;
   	/* Set the start value (period), count down */
   	REG(timerBaseAddr+ GPTIMER_TAILR) = period;
   	/* Set the deassert period */
   	REG(timerBaseAddr + GPTIMER_TAMATCHR) = dutyCycle;
        timer_enable_reg_bit_mask = GPTIMER_CTL_TAEN;
   	}
   else if ( timerName == GPTIMER_B )
   {
   	REG(timerBaseAddr + GPTIMER_TBMR) = 0;
   	REG(timerBaseAddr + GPTIMER_TBMR) |= GPTIMER_TBMR_TBAMS;
   	REG(timerBaseAddr + GPTIMER_TBMR) |= GPTIMER_TBMR_TBMR_PERIODIC;
   	/* Set the start value (period), count down */
   	REG(timerBaseAddr+ GPTIMER_TBILR) = period;
   	/* Set the deassert period */
   	REG(timerBaseAddr + GPTIMER_TBMATCHR) = dutyCycle;
        timer_enable_reg_bit_mask = GPTIMER_CTL_TBEN;
  	}
   else
   {   	
    	retval = PWM_DRIVER_INIT_FAILED; 
	printf( "Wrong Timer Name parameter\n");
        return retval;
  	}

   /* Configure pin for PWM */
   ioc_set_sel(gpioPortNum, gpioPinNumber, periph_output_signal_to_pad);
   ioc_set_over(gpioPortNum, gpioPinNumber, IOC_OVERRIDE_OE);
   GPIO_PERIPHERAL_CONTROL(GPIO_PORT_TO_BASE(gpioPortNum), GPIO_PIN_MASK(gpioPinNumber));
   
   /* Enable the appropriate TimerA/B */
   REG(GPTIMER_CTL + timerBaseAddr ) |= timer_enable_reg_bit_mask;
  
   return retval;
}



void pwm_driver_pwm_mode (uint32_t period , uint32_t match )
{
  /* Enable module clock for the GPTx in Active mode */
  REG(SYS_CTRL_RCGCGPT) |= SYS_CTRL_RCGCGPT_GPT2;
   /* Stop the timer */
   /* Step1 : Ensure the timer is disabled (the TnEN bit is cleared) before making any changes */
   REG(GPT_2_BASE + GPTIMER_CTL) = 0;    // step 1


   /* Use 16-bit timer */
   /* Step2 : Write the GPTM Configuration (GPTIMER_CFG) register with a value of 0x0000.0004.*/
   REG(GPT_2_BASE + GPTIMER_CFG) = 0x04; // step 2

   /* Configure PWM mode */
/* Step3 :In the GPTM Timer Mode (GPTIMER_TnMR) register, write the TnCMR field to 0x1 and the TnMR field to 0x2  */
   REG(GPT_2_BASE + GPTIMER_TAMR) = 0;
   //REG(GPT_2_BASE + GPTIMER_TAMR) |= GPTIMER_TAMR_TAAMS;  // changed
   REG(GPT_2_BASE + GPTIMER_TAMR) |= GPTIMER_TAMR_TACMR;
   REG(GPT_2_BASE + GPTIMER_TAMR) |= GPTIMER_TAMR_TAMR_PERIODIC;

/* Step4 :Configure the output state of the PWM signal (whether or not it is inverted) in the TnPWML field of the GPTM Control (GPTIMER_CTL) register. */
   REG(GPT_2_BASE + GPTIMER_CTL) |= GPTIMER_CTL_TAPWML;

/* Step5 : If a prescaler is to be used, write the prescale value to the GPTM Timer n Prescale Register
(GPTIMER_TnPR). */

/* Step6 : If PWM interrupts are used, configure the interrupt condition in the TnEVENT field in the
GPTIMER_CTL register and enable the interrupts by setting the TnPWMIE bit in the GPTIMER_TnMR
register */

/* Step7 :  Load the timer start value into the GPTM Timer n Interval Load (GPTIMER_TnILR) register */
   /* Set the start value (period), count down */
   REG(GPT_2_BASE+ GPTIMER_TAILR) = period ; //999;

/* Step8 :  Load the GPTM Timer n Match (GPTIMER_TnMATCHR) register with the match value */
   /* Set the deassert period */
   REG(GPT_2_BASE + GPTIMER_TAMATCHR) = match;//50;

/* Step9 : Set the TnEN bit in the GPTM Control (GPTIMER_CTL) register to enable the timer and begin
generation of the output PWM signal */

   /* Configure pin */
   ioc_set_sel(GPIO_A_NUM, 3, IOC_PXX_SEL_GPT2_ICP1);
   ioc_set_over(GPIO_A_NUM, 3, IOC_OVERRIDE_OE);
   GPIO_PERIPHERAL_CONTROL(GPIO_PORT_TO_BASE(GPIO_A_NUM), GPIO_PIN_MASK(3));
   /* Enable */
   REG(GPTIMER_CTL + GPT_2_BASE ) |= GPTIMER_CTL_TAEN;

}


//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
